[
    "I’m so sorry, it's over.",
    "I’m just trying to do what’s right for both of us.",
    "I want my key back.",
    "I just need some time to think about things.",
    "I never meant to hurt you.",
    "This is hard for me, too.",
    "I hope we can still be friends.",
    "I’m just not ready to settle down.",
    "Where is this going? We need to stop.",
    "I can’t do this anymore.",
    "You’re going to make someone so happy someday.",
    "I’m not in love with you anymore.",
    "You’re more like a [roommate/friend/sibling].",
    "I need to focus on my career.",
    "You’re not the person I fell in love with.",
    "All we do is fight.",
    "I wish I never met you.",
    "There’s someone else.",
    "I just need some space.",
    "It’s over, it has been for a while.",
    "I can’t even look at you anymore.",
    "It’s not me, it’s you.",
    "Its not you, it’s me.",
    "I think you’re an amazing person, but.",
    "It's over. Tell me you’re going to be okay.",
    "You deserve better than this.",
    "Don’t ever talk to me again.",
    "I just want things to go back to how they used to be.",
    "When can I pick up my stuff?.",
    "You broke my heart, so I am breaking yours.",
    "This isn’t working.",
    "I never want to get married.",
    "I don’t feel the same way anymore.",
    "Its not working out.",
    "I’ve changed, you’ve changed, we’ve changed.",
    "I like someone else.",
    "Our lives are going in different directions.",
    "You're just so much more mature than me.",
    "I don't want you to get hurt.",
    "I might be moving out of state in a couple of years. I don't want to date you and then just move away.",
    "I can’t do this anymore.",
    "I’m not really over my ex, so it’s not fair to you.",
    "I'm not ready to be in a relationship.",
    "I’m bringing you down.",
    "Summer is on its way, so let's see how we feel about each other in the fall.",
    "We are done, because internet is not working.",
    "You Deserve Better.",
    "I'm Scared Of Commitment.",
    "I'm Not Ready For A Relationship Right Now.",
    "Whoever Ends Up With You Is So Lucky.",
    "Can we take a break?.",
    "I Just Really Need To Focus On School Right Now.",
    "I Just Need A Little Space.",
    "I Like You TOO Much to be with you.",
    "I love you, I’m just not inlove with you.",
    "I really just need to work on myself.",
    "I think we should see other people.",
    "We’re just on two different paths right now.",
    "I just don’t feel that spark.",
    "We’re just better off friends, you know?.",
    "I just can’t emotionally handle a relationship right now.",
    "I’m too young to be tied down.",
    "I don’t really see a future together.",
    "If you love something let it go, and if it returns it was meant to be.",
    "I love you and I won't be able to bear it if I lose you. Before that happens, let's break up.",
    "I like bacon. You don't like bacon. We're done.",
    "You're spending too much time with your dying father.",
    "I'm moving to Antarctica. Yes, I know I'm not a scientist. I'll find work. Please don't call me.' ...I don't know what I did, but I always tell myself I dodged a crazy bullet.",
    "Your soul is not developed enough to be loved.' Umm, what?.",
    "You know when you walk down the street and you think a guy is really hot?' Me: 'Um, I guess...' Him: 'Well, I do too..",
    "I love you so much and want to spend the rest of my life with you. We have to break up. If it's really meant to be then we will end up together again like they do in the movies.",
    "You go to Chipotle too much and I'm teaching piano two hours a week now, so we just don't have time for each other.' To be fair I do go to Chipotle 3-5 times a week, but c'mon, really?.",
    "You have too much money. You pay for every date. I think you're doing something illegal. Also, you're never around much. It seems like you don't care about me at all.",
    "My mom thinks your face is too... controlling and bitchy and that means I wouldn't have any control over you.",
    "I feel called to be a pastor's wife and you re not going to be a pastor.",
    "I just can't afford two gifts this year, but we can go back out after Christmas.",
    "I'M MOVING TO A FOREIGN COUNTRY, BUT I'LL CALL YOU WHEN I GET BACK.",
    "YOU CAN DO SO MUCH BETTER THAN ME.",
    "IT HAS BEEN SO GREAT GETTING TO KNOW YOU, BUT I THINK WE NEED TO SPEND TIME WITH OTHER PEOPLE.",
    "I'VE GOT A FEAR OF COMMITMENT.",
    "I'M FEELING SMOTHERED, AND I JUST NEED TO GET SOME SPACE.",
    "THE GUY WHO MARRIES YOU IS SO LUCKY!.",
    "I THINK WE NEED TO SEE OTHER PEOPLE AND JUST SEE WHAT HAPPENS.",
    "I STILL WANT TO BE WITH YOU, BUT I JUST WANT TO TAKE A BREAK.",
    "I'VE GOT A LOT OF ISSUES I NEED TO WORK ON RIGHT NOW.",
    "I FEEL LIKE YOU'RE MORE OF A FRIEND THAN A GIRLFRIEND TO ME.",
    "I JUST NEED SOMETHING MORE.",
    "I WISH WE'D MET FIVE YEARS FROM NOW INSTEAD.",
    "WE'RE JUST IN TOTALLY DIFFERENT PLACES IN OUR LIVES.",
    "I JUST RESPECT YOU SO MUCH.",
    "I THINK WE GOT TOO CLOSE, TOO FAST.",
    "We don't fight enough so you must not care about this relationship as much as I do.",
    "I am breaking up because you don't like Eminem.",
    "You're like my Jacob, I want to find my Edward.",
    "Your hands are always so sweaty. This isn't working out.",
    "You bought my dog a toy. I thought he was moving too fast.",
    "It’s not what I want, it’s what’s good for me.",
    "It’s all my fault.",
    "“I still love you.",
    "We’ll still be friends.",
    "This is harder for me than it is for you.",
    "I can’t give you what you want.",
    "You’ll understand someday.",
    "I still have feelings for someone else.",
    "I just need some space, and time to ‘do me.",
    "I’m too young to settle down.",
    "You deserve someone better than me.",
    "I can’t handle a long distance relationship.",
    "We both need a break for us.  We’ll be better for it..",
    "I need to find myself.",
    "I don’t want to hold you back."
]
