[
    "Buy them a smile- Buy them their favourite perfume and gift them a smile. This will be a decent and beautiful gift for them. Get the perfume and put it on their dressing table and let them discover it on their own."
    "Write a note- Write them a note. A love note! Leave this love note inside his bag or some drawer."
    "Dress up- Dress up in a sexy outfit. Be ready before they get home from the workplace. Improve the ambience. Make the atmosphere romantic by few candles."
    "Send them a short e-mail. No doubt, they will be surprised like never before."
    "Fill up the fridge. Fill up the fridge with their favourite snacks and beer. And let them discover it on their own."
    "Take them to a ride. It can be a car ride or may be a hot air balloon ride."
    "Agree to something unusual. You can surprise them by agreeing to something, they have been convincing you for so long."
    "Send them bouquet and their favourite eatables at their workplace."
    "Help them with something. May it be household work or some regular work."
    "Take their pet for a walk."
    "Have lunch together."
    "Cuddle and have pizza."
    "Plan for a surprise movie."
    "Offer your girlfriend a pedicure."
    "Offer a massage"
    "Join some hobby class together. It can be music or dance or maybe gym too."
    "Do something special for their relatives. It can be their sister, brother, father or mother."
    "Go drunk together."
    "If you don’t like any habit of them, let it go. Ignore it for your love."
    "Let them choose the movie this time."
    "Have a Pajama Party."
    "Go for a long drive."
    "Arrange some wine, and have some quality time with them."
    "Call them by a cute and lovable nickname."
    "Make special dinner."
    "Make a cute frame with the best picture of yours."
    "Clean the washroom for them."
    "Help them with their laundry."
    "Buy a cute card and keep it in his coat."
    "Take a calendar and mark the important dates on that calendar."
    "Clean your room."
    "Plan a romantic dance. A couple dance."
    "Spend all day with them."
    "Make a scrapbook for them. Paste all your favourite pictures."
    "Surprise party- Invite all their friends and have fun in the surprise party."
    "Send a tempting picture to them."
    "Leave a note for them to meet at their favourite restaurant."
    "Leave a love note on the mirror of your washroom so he sees to it as soon as he wakes up."
    "Wash the car together."
    "Arrange a photo-shoot for both of you."
    "Go for a holiday!"
    "Have a talk about your further plans, your future plans."
    "Spread flowers on your bed."
    "Tell them that from now, one day of the week will be ‘their day’."
    "Make his favourite pizza delivered to him."
    "Organise a family outing."
    "Organise a picnic."
    "Explore each other"
    "Kneel down and propose."
    "Take them to a museum or some exhibition."
    "Explore their likes and unlikes."
    "Go for a walk."
    "Give them a tight hug."
    "Write a note on the tissue paper and keep it inside their lunch."
    "Make them feel that they are important."
    "Gift some of their favourite books."
    "Drive yourself."
    "Flirting is like meditation. Flirt with them as much as you can."
    "Play video games together."
    "Compliment them."
    "Share some laughs together."
    "Bath together"
    "Learn their favourite recipe and make it for them."
    "Offer them the last slice of the pizza."
    "Smile at their talks."
    "Get up early one day for them"
    "Get a new hairstyle."
    "Offer to shave their face."
    "Play their favourite sport, may it be golf or cricket."
    "Take them out to watch the match."
    "Gift a teddy bear. ( one of most popular valentines day idea)"
    "Learn a new skill from each other."
    "Discover a park nearby and spend some time there together."
    "Go to a beach."
    "Leave a lipstick kiss mark on his shirt."
    "Gift him a tie."
    "Iron their clothes."
    "Go for a horse ride."
    "Give them a good night kiss."
    "Pamper them."
    "Buy them something that they were planning to buy."
    "Feed them dinner with your hands."
    "Praise their relatives."
    "Praise them in front of their friends."
    "Hold their hand in public."
    "Introduce them to your friends."
    "Tell them that you are proud of them."
    "Go and watch the sunset and talk about each other."
    "Kiss them hard."
    "Sing a song for them."
    "Go for a midnight ice-cream date."
    "Buy them a sexy nightdress."
    "Candlelight dinner."
    "Chocolates will make it special."
    "Text them throughout the day."
    "Wake them up with cuddling."
    "Visit the best place in this world- Your best memories."
    "Appreciate them."
    "Take photographs of every moment."
    "Tell them they are beautiful"
]
